## 1. Pandas

<div align="left">
    <img src="pandas_logo.png">
</div>

- comes with the Anaconda distribution of Python
- an open source library used for data manipulation and analysis
- offers data structures and operations for manipulating numerical tables and time series
- 2 main data structures: Series and DataFrame
- good for importing and exporting data to and from various data sources (csv, Excel, database)
- it's convention to alias pandas as pd for brevity

In [1]:
import pandas as pd
import numpy as np

## 2. Series
<div algin="left">
<img src="ser1.png" width="20%" height="20%">
</div>


Series objects are made up of two arrays
- a N-dimensional container of items with a specified data type (similar to the NumPy array)
- the second is an array index, which by default uses zero-based numbering (the index starts with 0 and not 1) but can be explicitly defined
- can hold any data type
- think of it as a row or column of data

In [2]:
data = np.random.randint(5, 10, 10)
data

array([9, 9, 7, 9, 7, 9, 9, 6, 9, 6])

In [3]:
s = pd.Series(data = data)

# .head() method:
#  - Return the first n rows
#  - Default is first 5 rows

s.head(8)

0    9
1    9
2    7
3    9
4    7
5    9
6    9
7    6
dtype: int32

Creating a Series from a list

In [4]:
s = pd.Series([2, 5, 2, 6, 8, 7], name='df_column_name')
s

0    2
1    5
2    2
3    6
4    8
5    7
Name: df_column_name, dtype: int64

Creating a Series from a tuple

In [5]:
s = pd.Series((3, 5, 4, 5, 7, 4))
s

0    3
1    5
2    4
3    5
4    7
5    4
dtype: int64

### Series Index
- A Series with an index

In [6]:
data = np.random.random(10)
data

array([0.73947633, 0.92038891, 0.41764179, 0.15032443, 0.19317222,
       0.21897396, 0.02890426, 0.65542437, 0.65948988, 0.14028692])

In [7]:
date_index = pd.date_range('2019-01-01', periods=len(data))
date_index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10'],
              dtype='datetime64[ns]', freq='D')

In [8]:
s = pd.Series(data, date_index, name="VolatileStock")
s.head(10)

2019-01-01    0.739476
2019-01-02    0.920389
2019-01-03    0.417642
2019-01-04    0.150324
2019-01-05    0.193172
2019-01-06    0.218974
2019-01-07    0.028904
2019-01-08    0.655424
2019-01-09    0.659490
2019-01-10    0.140287
Freq: D, Name: VolatileStock, dtype: float64

### Arithmetic with Series
- Series can perform many arithmetic operations

<div>
    <img src="ao.png">
</div>

In [9]:
s1 = pd.Series([0, 1, 2, 3, 4])
s2 = pd.Series(range(5))

print('s1:\n{}'.format(s1))
print('\n')
print(f's2:\n{s2}')
print('\n')
print(f'The sum of s1 and s2:\n{s1 + s2}')

s1:
0    0
1    1
2    2
3    3
4    4
dtype: int64


s2:
0    0
1    1
2    2
3    3
4    4
dtype: int64


The sum of s1 and s2:
0    0
1    2
2    4
3    6
4    8
dtype: int64

In [10]:
s1 + s2

0    0
1    2
2    4
3    6
4    8
dtype: int64

Series s1 multiplied by Series s2

In [11]:
s1 * s2

0     0
1     1
2     4
3     9
4    16
dtype: int64

Series s1 multiplied by an integer / scalar

In [12]:
s1 * 5

0     0
1     5
2    10
3    15
4    20
dtype: int64

## 3. DataFrame

<div align="left">
    <img src="df.png" height="100%" width="100%">
</div>

- a heterogeneous tabular data structure with labeled axes (rows and columns) and is based off of the NumPy library.
- can contain various data of different data types.
- each column is a Series object
- can be constructed in from various objects or data sources (Python dictionary, Excel file, CSV file, SQL query)

### Creating DataFrame from Scratch
`pandas.DataFrame(data=None, index=None, columns=None, dtype=None)`
- data : numpy ndarray
- index : Index or array-like
    Index to use for resulting frame.   
- columns : Index or array-like
    Column labels to use for resulting frame.    
- dtype : dtype, default None
    Data type to force.

In [13]:
data = np.random.randint(1, 30, 60).reshape(15, 4)
columns = ['Apples', 'Pears', 'Oranges', 'Grapefruit']
index = pd.date_range(start='2000-01-01', periods=len(data))

<img src="fd.png" style="margin-left:0px">

In [ ]:
##print(f'Data: \n{data}\n\n'
##     + 'Columns: \n%s\n\n' % columns
##     + 'Index: \n{}'.format(index))

In [14]:
df = pd.DataFrame(data=data, columns=columns, index=index)
df

            Apples  Pears  Oranges  Grapefruit
2000-01-01      28      4       24           3
2000-01-02       5     11        2          17
2000-01-03      20     23        2           8
2000-01-04      14     28        7           7
2000-01-05      27     18       23          22
2000-01-06       1     10       13          12
2000-01-07      23     15       22           3
2000-01-08      26     25        1          15
2000-01-09       1     29        8           6
2000-01-10      18     11        5          18
2000-01-11       9      3        9          16
2000-01-12       1     22       10           5
2000-01-13      24     16        3           6
2000-01-14      15     11       12          18
2000-01-15      16     22       18          25

In [15]:
index = pd.date_range(start='2000-01-01', periods=10)

data_dict = {'Apples':np.random.randint(2,8,10),
             'Pears':np.random.randint(3,10,10),
             'Oranges':np.random.randint(1,50,10),
             'Grapefruit':np.random.randint(2,12,10)}

data_dict

{'Apples': array([7, 2, 2, 5, 5, 6, 7, 3, 7, 3]),
 'Pears': array([8, 3, 8, 3, 5, 9, 6, 3, 7, 7]),
 'Oranges': array([ 2, 28, 16, 18, 13,  7,  3,  1, 11, 19]),
 'Grapefruit': array([ 4,  7, 11,  3,  5,  2, 10,  5, 10, 10])}

In [16]:
pd.DataFrame(data_dict, index=index).head()

            Apples  Pears  Oranges  Grapefruit
2000-01-01       7      8        2           4
2000-01-02       2      3       28           7
2000-01-03       2      8       16          11
2000-01-04       5      3       18           3
2000-01-05       5      5       13           5

### DataFrame Axis

- The pandas DataFrame has two axis 0 (rows) and 1 (columns)
- The pandas DataFrame also has two separate indices

<img src="pandas-dataframe.png" style="margin-left:0px">

In [17]:
df.head()

            Apples  Pears  Oranges  Grapefruit
2000-01-01      28      4       24           3
2000-01-02       5     11        2          17
2000-01-03      20     23        2           8
2000-01-04      14     28        7           7
2000-01-05      27     18       23          22

axis = 0 for rows

In [18]:
print('Average lbs Sold Per Product')
df.apply(np.mean, axis=0)

Average lbs Sold Per Product

Apples        15.200000
Pears         16.533333
Oranges       10.600000
Grapefruit    12.066667
dtype: float64

axis = 1 for columns

In [19]:
print('Average of Total lbs in Fruit Sold Per Day')
df.apply(np.mean, axis=1)

Average of Total lbs in Fruit Sold Per Day

2000-01-01    14.75
2000-01-02     8.75
2000-01-03    13.25
2000-01-04    14.00
2000-01-05    22.50
2000-01-06     9.00
2000-01-07    15.75
2000-01-08    16.75
2000-01-09    11.00
2000-01-10    13.00
2000-01-11     9.25
2000-01-12     9.50
2000-01-13    12.25
2000-01-14    14.00
2000-01-15    20.25
Freq: D, dtype: float64

### pandas.read() Methods
- pandas has the ability to read data from various data sources using .read() methods, some are listed below:
    - `pandas.read_csv('file.csv')` - reads in .csv and .txt files
    - `pandas.read_excel('file.xlsx')` - reads in xlsx or xls files

In [20]:
del(df)

In [21]:
df = pd.read_excel('lbs_sold.xlsx')
df.head()

   Date Sold  Apples  Pears  Oranges  Grapefruit
0 2000-01-01      25      5       29           4
1 2000-01-02      23     26       22          15
2 2000-01-03      29     13       15          21
3 2000-01-04      21      1       17          21
4 2000-01-05      17      3       15           1

In [22]:
df = pd.read_csv('store1.csv')
df.head()

   ProductID Product Date Sold  Total lbs Sold  Price Per lb  Total
0      10012  Apples  1/1/2000              25          1.18  29.50
1      10012  Apples  1/2/2000              23          1.18  27.14
2      10012  Apples  1/3/2000              29          1.18  34.22
3      10012  Apples  1/4/2000              21          1.18  24.78
4      10012  Apples  1/5/2000              17          1.18  20.06

Fully qualified path name

In [24]:
df2 = pd.read_csv(r'prod\prod_info.csv',dtype={'ProductID':'object'})
df2

  ProductID     Product  Price Per lb
0     10012      Apples          1.18
1     10013       Pears          1.52
2     10014     Oranges          1.39
3     10015  Grapefruit          1.35

### Selecting Elements of a DataFrame
- the `.columns` attribute of a DataFrame will display all the column names of a DataFrame
- the `.index` attribute of a DataFrame will display the index of the DataFrame
    - an unlabeled index will show the start, stop, and step indices of a DataFrame
    - a labeled index will display the index labels
- the `.values` attribute will display all of the values of the DataFrame as an array

In [25]:
df.columns

Index(['ProductID', 'Product', 'Date Sold', 'Total lbs Sold', 'Price Per lb',
       'Total'],
      dtype='object')

In [26]:
df.index

RangeIndex(start=0, stop=60, step=1)

In [28]:
df.values[:5]

array([[10012, 'Apples', '1/1/2000', 25, 1.18, 29.5],
       [10012, 'Apples', '1/2/2000', 23, 1.18, 27.14],
       [10012, 'Apples', '1/3/2000', 29, 1.18, 34.22],
       [10012, 'Apples', '1/4/2000', 21, 1.18, 24.78],
       [10012, 'Apples', '1/5/2000', 17, 1.18, 20.06]], dtype=object)

### DataFrame.info() method
- `.info()` method provides information on the DataFrame
- row count, column names, null values, and data types

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 6 columns):
ProductID         60 non-null int64
Product           60 non-null object
Date Sold         60 non-null object
Total lbs Sold    60 non-null int64
Price Per lb      60 non-null float64
Total             60 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.9+ KB

### Filtering DataFrames
- You can conditionally select elements from a DataFrame using Comparison Operators
- Syntax:
    - `DataFrame['ColumnName'] ComparisonOperator value`
    - example: `df['ProductID']==10012`

### Python Comparison Operators
<img src="co.png" style="margin-left:0px">

In [30]:
(df['ProductID'] == 10012).head(5)

0    True
1    True
2    True
3    True
4    True
Name: ProductID, dtype: bool

In [31]:
df[df['ProductID'] == 10012].head(5)

   ProductID Product Date Sold  Total lbs Sold  Price Per lb  Total
0      10012  Apples  1/1/2000              25          1.18  29.50
1      10012  Apples  1/2/2000              23          1.18  27.14
2      10012  Apples  1/3/2000              29          1.18  34.22
3      10012  Apples  1/4/2000              21          1.18  24.78
4      10012  Apples  1/5/2000              17          1.18  20.06

### Bistwise Operators

<img src="bo.png" style="margin-left:0px">

In [32]:
df[(df['ProductID'] == 10012) & (df['Total lbs Sold'] >= 12)]

    ProductID Product  Date Sold  Total lbs Sold  Price Per lb  Total
0       10012  Apples   1/1/2000              25          1.18  29.50
1       10012  Apples   1/2/2000              23          1.18  27.14
2       10012  Apples   1/3/2000              29          1.18  34.22
3       10012  Apples   1/4/2000              21          1.18  24.78
4       10012  Apples   1/5/2000              17          1.18  20.06
7       10012  Apples   1/8/2000              25          1.18  29.50
8       10012  Apples   1/9/2000              28          1.18  33.04
10      10012  Apples  1/11/2000              22          1.18  25.96
13      10012  Apples  1/14/2000              20          1.18  23.60
14      10012  Apples  1/15/2000              18          1.18  21.24

In [33]:
# Raise ValueError
df[(df['ProductID']==10012) and (df['Total lbs Sold']>=12)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

### .drop() Method
- Remove rows or columns by specifying label names and corresponding axis

<img src="drop2.png" style="margin-left:0px">
<img src="drop.png" style="margin-left:0px">

In [34]:
df.drop(['Price Per lb'], axis=1, inplace=True)
df.head()

   ProductID Product Date Sold  Total lbs Sold  Total
0      10012  Apples  1/1/2000              25  29.50
1      10012  Apples  1/2/2000              23  27.14
2      10012  Apples  1/3/2000              29  34.22
3      10012  Apples  1/4/2000              21  24.78
4      10012  Apples  1/5/2000              17  20.06

### Slicing / Subsetting DataFrames
- DataFrames can be subset based on the row and column indices
- `df_name[start:stop:step]` step is optional

Start on row index 2 and stop on row index 6 excluding row index 6 and below

In [35]:
df[2:6]

   ProductID Product Date Sold  Total lbs Sold  Total
2      10012  Apples  1/3/2000              29  34.22
3      10012  Apples  1/4/2000              21  24.78
4      10012  Apples  1/5/2000              17  20.06
5      10012  Apples  1/6/2000               6   7.08

In [36]:
df[2:20:2]

    ProductID Product  Date Sold  Total lbs Sold  Total
2       10012  Apples   1/3/2000              29  34.22
4       10012  Apples   1/5/2000              17  20.06
6       10012  Apples   1/7/2000              10  11.80
8       10012  Apples   1/9/2000              28  33.04
10      10012  Apples  1/11/2000              22  25.96
12      10012  Apples  1/13/2000              11  12.98
14      10012  Apples  1/15/2000              18  21.24
16      10013   Pears   1/2/2000              26  39.52
18      10013   Pears   1/4/2000               1   1.52

In [37]:
df[2:6]

   ProductID Product Date Sold  Total lbs Sold  Total
2      10012  Apples  1/3/2000              29  34.22
3      10012  Apples  1/4/2000              21  24.78
4      10012  Apples  1/5/2000              17  20.06
5      10012  Apples  1/6/2000               6   7.08

### Subsetting with .loc and .iloc
- you can also be explicit about what index you are filtering on
- `.iloc[]` will return the index in its original 0-based indexing order regardless of what you set the index as
- `.loc[]` will return the specified index by its name/label

In [38]:
# set_index() is used to set a column as the index
# returns a new DataFrame if inplace=False; modifies the existing DataFrame if inplace=True

df.set_index('Date Sold', inplace=True)

In [39]:
df.iloc[0:5]

           ProductID Product  Total lbs Sold  Total
Date Sold
1/1/2000       10012  Apples              25  29.50
1/2/2000       10012  Apples              23  27.14
1/3/2000       10012  Apples              29  34.22
1/4/2000       10012  Apples              21  24.78
1/5/2000       10012  Apples              17  20.06

In [40]:
df.loc[['1/1/2000', '1/5/2000']]

           ProductID     Product  Total lbs Sold  Total
Date Sold
1/1/2000       10012      Apples              25  29.50
1/1/2000       10013       Pears               5   7.60
1/1/2000       10014     Oranges              29  40.31
1/1/2000       10015  Grapefruit               4   5.40
1/5/2000       10012      Apples              17  20.06
1/5/2000       10013       Pears               3   4.56
1/5/2000       10014     Oranges              15  20.85
1/5/2000       10015  Grapefruit               1   1.35

### Subsetting Columns
- Columns can be subset by passing the specified column names to the DataFrame in double brackets followed by a comma
- `df[[column1, column3, column10]]`
- `df[column1]` will return a Series instead

In [41]:
df[['ProductID', 'Product', 'Total']].head(3)

           ProductID Product  Total
Date Sold
1/1/2000       10012  Apples  29.50
1/2/2000       10012  Apples  27.14
1/3/2000       10012  Apples  34.22

### Groupby Method
- A groupby operation involves some combination of splitting the object, applying a function, and combining the results
- `df.groupby(by=['col1','col2'], axis=0))['col_to_aggregate','col_to_aggregate'].aggregate_function`

In [42]:
df.head()

           ProductID Product  Total lbs Sold  Total
Date Sold
1/1/2000       10012  Apples              25  29.50
1/2/2000       10012  Apples              23  27.14
1/3/2000       10012  Apples              29  34.22
1/4/2000       10012  Apples              21  24.78
1/5/2000       10012  Apples              17  20.06

What is the total lbs sold and total over the 15 day time period for each product by name?

In [43]:
df.groupby(by=['ProductID','Product'], axis=0)['Total lbs Sold','Total'].sum()

                      Total lbs Sold   Total
ProductID Product
10012     Apples                 267  315.06
10013     Pears                  223  338.96
10014     Oranges                265  368.35
10015     Grapefruit             218  294.30

### Reshaping/Transforming Data

In [44]:
df = pd.read_excel('lbs_sold.xlsx')

#### Melting a DataFrame

- unpivots a DataFrame from wide format to long format

In [45]:
df = pd.melt(df, var_name='Product', value_name='Total lbs Sold', id_vars='Date Sold')
df.head(20)

    Date Sold Product  Total lbs Sold
0  2000-01-01  Apples              25
1  2000-01-02  Apples              23
2  2000-01-03  Apples              29
3  2000-01-04  Apples              21
4  2000-01-05  Apples              17
5  2000-01-06  Apples               6
6  2000-01-07  Apples              10
7  2000-01-08  Apples              25
8  2000-01-09  Apples              28
9  2000-01-10  Apples               1
10 2000-01-11  Apples              22
11 2000-01-12  Apples              11
12 2000-01-13  Apples              11
13 2000-01-14  Apples              20
14 2000-01-15  Apples              18
15 2000-01-01   Pears               5
16 2000-01-02   Pears              26
17 2000-01-03   Pears              13
18 2000-01-04   Pears               1
19 2000-01-05   Pears               3

#### Merging/Combining DataFrames

Joining/combining DataFrame on columns or indexes

In [46]:
df3 = pd.merge(df, df2, how='left', on='Product')
df3.head(5)

   Date Sold Product  Total lbs Sold ProductID  Price Per lb
0 2000-01-01  Apples              25     10012          1.18
1 2000-01-02  Apples              23     10012          1.18
2 2000-01-03  Apples              29     10012          1.18
3 2000-01-04  Apples              21     10012          1.18
4 2000-01-05  Apples              17     10012          1.18

In [47]:
df3 = df3[['ProductID', 'Product', 'Date Sold', 'Total lbs Sold', 'Price Per lb']]
df3.head(3)

  ProductID Product  Date Sold  Total lbs Sold  Price Per lb
0     10012  Apples 2000-01-01              25          1.18
1     10012  Apples 2000-01-02              23          1.18
2     10012  Apples 2000-01-03              29          1.18

In [48]:
df3['Total'] = df3['Total lbs Sold'] * df3['Price Per lb']
df3.head()

  ProductID Product  Date Sold  Total lbs Sold  Price Per lb  Total
0     10012  Apples 2000-01-01              25          1.18  29.50
1     10012  Apples 2000-01-02              23          1.18  27.14
2     10012  Apples 2000-01-03              29          1.18  34.22
3     10012  Apples 2000-01-04              21          1.18  24.78
4     10012  Apples 2000-01-05              17          1.18  20.06

#### Pivoting DataFrames

- creates a spreadsheet-style pivot table as a DataFrame

In [49]:
pd.pivot_table(df3, values=['Total lbs Sold'], columns='Product', index='Date Sold')

           Total lbs Sold
Product            Apples Grapefruit Oranges Pears
Date Sold
2000-01-01             25          4      29     5
2000-01-02             23         15      22    26
2000-01-03             29         21      15    13
2000-01-04             21         21      17     1
2000-01-05             17          1      15     3
2000-01-06              6         21      13     5
2000-01-07             10         28      23     3
2000-01-08             25         16      22    25
2000-01-09             28         12      23    26
2000-01-10              1         14      12    15
2000-01-11             22         24      15    13
2000-01-12             11          9      28    22
2000-01-13             11         13      12    21
2000-01-14             20         13      11    26
2000-01-15             18          6       8    19